/*
    Итерация №0: x = 900
    Итерация №100: x = 871
    Итерация №200: x = 764
    Итерация №300: x = 590
            ...
    Итерация №100000: x = 285


    Числа от балды взял.
*/


program {
    shared int i = 1;
    shared int x = 900;

    thread:1 (i, x) {
        for (; i <= 100000; i = i + 1)
            x = iterate(i, x); /* что-то сложное */
    }

    thread:2 (i, x) {
        while (i <= 100000) {
            if (i % 1000 == 0)
                write("Итерация №", i, ": x = ", x);
        }
    }

    employ_threads(1, 2);
}